-- phpMyAdmin SQL Dump
-- version 3.5.1
-- http://www.phpmyadmin.net
--
-- Хост: 127.0.0.1
-- Время создания: Авг 27 2017 г., 14:42
-- Версия сервера: 5.5.25
-- Версия PHP: 5.3.13

SET SQL_MODE="NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";

--
-- База данных: `geekshop`
--

-- --------------------------------------------------------

--
-- Структура таблицы `comments`
--

CREATE TABLE IF NOT EXISTS `comments` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `text` text,
  `product_id` int(11) NOT NULL,
  PRIMARY KEY (`id`),
  UNIQUE KEY `comments_id_uindex` (`id`)
) ENGINE=InnoDB  DEFAULT CHARSET=utf8 AVG_ROW_LENGTH=2048 AUTO_INCREMENT=15 ;

--
-- Дамп данных таблицы `comments`
--

INSERT INTO `comments` (`id`, `text`, `product_id`) VALUES
(12, 'павып авы папав', 1),
(13, 'павып авы папав', 1),
(14, 'gfdsgf ds gfds gfd', 1);

-- --------------------------------------------------------

--
-- Структура таблицы `images`
--

CREATE TABLE IF NOT EXISTS `images` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `product_id` int(11) NOT NULL,
  `preview` int(1) NOT NULL DEFAULT '0',
  `image` varchar(255) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB  DEFAULT CHARSET=utf8 AVG_ROW_LENGTH=5461 AUTO_INCREMENT=14 ;

--
-- Дамп данных таблицы `images`
--

INSERT INTO `images` (`id`, `product_id`, `preview`, `image`) VALUES
(10, 1, 1, 'socks.jpg'),
(11, 2, 1, 'blackShirt.jpg'),
(12, 3, 1, 'blueDenim.jpg'),
(13, 1, 0, 'socks2.jpg');

-- --------------------------------------------------------

--
-- Структура таблицы `products`
--

CREATE TABLE IF NOT EXISTS `products` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `name` varchar(50) NOT NULL,
  `short_description` varchar(255) DEFAULT NULL,
  `description` text,
  `price` float DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB  DEFAULT CHARSET=utf8 AVG_ROW_LENGTH=4096 AUTO_INCREMENT=163 ;

--
-- Дамп данных таблицы `products`
--

INSERT INTO `products` (`id`, `name`, `short_description`, `description`, `price`) VALUES
(1, 'Носки', 'Черные носки', 'хлопок 100', 20),
(2, 'Черная рубашка', 'Черная рубашка', 'Не Шелк', 200),
(3, 'Штаны', 'Синий деним', 'супер пупер', 2000),
(4, 'Штаны1', 'Синий деним', 'супер пупер', 11),
(5, 'Штаны1', 'Синий деним', 'супер пупер', 11),
(6, 'Штаны1', 'Синий деним', 'супер пупер', 11),
(7, 'Штаны1', 'Синий деним', 'супер пупер', 11),
(8, 'Штаны1', 'Синий деним', 'супер пупер', 11),
(9, 'Штаны1', 'Синий деним', 'супер пупер', 11),
(10, 'Штаны1', 'Синий деним', 'супер пупер', 11),
(11, 'Штаны1', 'Синий деним', 'супер пупер', 11),
(12, 'Штаны1', 'Синий деним', 'супер пупер', 11),
(13, 'Штаны1', 'Синий деним', 'супер пупер', 11),
(14, 'Штаны1', 'Синий деним', 'супер пупер', 11),
(15, 'Штаны1', 'Синий деним', 'супер пупер', 11),
(16, 'Штаны1', 'Синий деним', 'супер пупер', 11),
(17, 'Штаны1', 'Синий деним', 'супер пупер', 11),
(18, 'Штаны1', 'Синий деним', 'супер пупер', 11),
(19, 'Штаны1', 'Синий деним', 'супер пупер', 11),
(20, 'Штаны1', 'Синий деним', 'супер пупер', 11),
(21, 'Штаны1', 'Синий деним', 'супер пупер', 11),
(22, 'Штаны1', 'Синий деним', 'супер пупер', 11),
(23, 'Штаны1', 'Синий деним', 'супер пупер', 11),
(24, 'Штаны1', 'Синий деним', 'супер пупер', 11),
(25, 'Штаны1', 'Синий деним', 'супер пупер', 11),
(26, 'Штаны1', 'Синий деним', 'супер пупер', 11),
(27, 'Штаны1', 'Синий деним', 'супер пупер', 11),
(28, 'Штаны1', 'Синий деним', 'супер пупер', 11),
(29, 'Штаны1', 'Синий деним', 'супер пупер', 11),
(30, 'Штаны1', 'Синий деним', 'супер пупер', 11),
(31, 'Штаны1', 'Синий деним', 'супер пупер', 11),
(32, 'Штаны1', 'Синий деним', 'супер пупер', 11),
(33, 'Штаны1', 'Синий деним', 'супер пупер', 11),
(34, 'Штаны1', 'Синий деним', 'супер пупер', 11),
(35, 'Штаны1', 'Синий деним', 'супер пупер', 11),
(36, 'Штаны1', 'Синий деним', 'супер пупер', 11),
(37, 'Штаны1', 'Синий деним', 'супер пупер', 11),
(38, 'Штаны1', 'Синий деним', 'супер пупер', 11),
(39, 'Штаны1', 'Синий деним', 'супер пупер', 11),
(40, 'Штаны1', 'Синий деним', 'супер пупер', 11),
(41, 'Штаны1', 'Синий деним', 'супер пупер', 11),
(42, 'Штаны1', 'Синий деним', 'супер пупер', 11),
(43, 'Штаны1', 'Синий деним', 'супер пупер', 11),
(44, 'Штаны1', 'Синий деним', 'супер пупер', 11),
(45, 'Штаны1', 'Синий деним', 'супер пупер', 11),
(46, 'Штаны1', 'Синий деним', 'супер пупер', 11),
(47, 'Штаны1', 'Синий деним', 'супер пупер', 11),
(48, 'Штаны1', 'Синий деним', 'супер пупер', 11),
(49, 'Штаны1', 'Синий деним', 'супер пупер', 11),
(50, 'Штаны1', 'Синий деним', 'супер пупер', 11),
(51, 'Штаны1', 'Синий деним', 'супер пупер', 11),
(52, 'Штаны1', 'Синий деним', 'супер пупер', 11),
(53, 'Штаны1', 'Синий деним', 'супер пупер', 11),
(54, 'Штаны1', 'Синий деним', 'супер пупер', 11),
(55, 'Штаны1', 'Синий деним', 'супер пупер', 11),
(56, 'Штаны1', 'Синий деним', 'супер пупер', 11),
(57, 'Штаны1', 'Синий деним', 'супер пупер', 11),
(58, 'Штаны1', 'Синий деним', 'супер пупер', 11),
(59, 'Штаны1', 'Синий деним', 'супер пупер', 11),
(60, 'Штаны1', 'Синий деним', 'супер пупер', 11),
(61, 'Штаны1', 'Синий деним', 'супер пупер', 11),
(62, 'Штаны1', 'Синий деним', 'супер пупер', 11),
(63, 'Штаны1', 'Синий деним', 'супер пупер', 11),
(64, 'Штаны1', 'Синий деним', 'супер пупер', 11),
(65, 'Штаны1', 'Синий деним', 'супер пупер', 11),
(66, 'Штаны1', 'Синий деним', 'супер пупер', 11),
(67, 'Штаны1', 'Синий деним', 'супер пупер', 11),
(68, 'Штаны1', 'Синий деним', 'супер пупер', 11),
(69, 'Штаны1', 'Синий деним', 'супер пупер', 11),
(70, 'Штаны1', 'Синий деним', 'супер пупер', 11),
(71, 'Штаны1', 'Синий деним', 'супер пупер', 11),
(72, 'Штаны1', 'Синий деним', 'супер пупер', 11),
(73, 'Штаны1', 'Синий деним', 'супер пупер', 11),
(74, 'Штаны1', 'Синий деним', 'супер пупер', 11),
(75, 'Штаны1', 'Синий деним', 'супер пупер', 11),
(76, 'Штаны1', 'Синий деним', 'супер пупер', 11),
(77, 'Штаны1', 'Синий деним', 'супер пупер', 11),
(78, 'Штаны1', 'Синий деним', 'супер пупер', 11),
(79, 'Штаны1', 'Синий деним', 'супер пупер', 11),
(80, 'Штаны1', 'Синий деним', 'супер пупер', 11),
(81, 'Штаны1', 'Синий деним', 'супер пупер', 11),
(82, 'Штаны1', 'Синий деним', 'супер пупер', 11),
(83, 'Штаны1', 'Синий деним', 'супер пупер', 501),
(84, 'Штаны1', 'Синий деним', 'супер пупер', 11),
(85, 'Штаны1', 'Синий деним', 'супер пупер', 11),
(86, 'Штаны1', 'Синий деним', 'супер пупер', 11),
(87, 'Штаны1', 'Синий деним', 'супер пупер', 11),
(88, 'Штаны1', 'Синий деним', 'супер пупер', 11),
(89, 'Штаны1', 'Синий деним', 'супер пупер', 11),
(90, 'Штаны1', 'Синий деним', 'супер пупер', 11),
(91, 'Штаны1', 'Синий деним', 'супер пупер', 11),
(92, 'Штаны1', 'Синий деним', 'супер пупер', 11),
(93, 'Штаны1', 'Синий деним', 'супер пупер', 11),
(94, 'Штаны1', 'Синий деним', 'супер пупер', 11),
(95, 'Штаны1', 'Синий деним', 'супер пупер', 11),
(96, 'Штаны1', 'Синий деним', 'супер пупер', 11),
(97, 'Штаны1', 'Синий деним', 'супер пупер', 11),
(98, 'Штаны1', 'Синий деним', 'супер пупер', 11),
(99, 'Штаны1', 'Синий деним', 'супер пупер', 11),
(100, 'Штаны1', 'Синий деним', 'супер пупер', 11),
(101, 'Штаны1', 'Синий деним', 'супер пупер', 11),
(102, 'Штаны1', 'Синий деним', 'супер пупер', 11),
(103, 'Штаны1', 'Синий деним', 'супер пупер', 11),
(104, 'Штаны1', 'Синий деним', 'супер пупер', 11),
(105, 'Штаны1', 'Синий деним', 'супер пупер', 11),
(106, 'Штаны1', 'Синий деним', 'супер пупер', 11),
(107, 'Штаны1', 'Синий деним', 'супер пупер', 11),
(108, 'Штаны1', 'Синий деним', 'супер пупер', 11),
(109, 'Штаны1', 'Синий деним', 'супер пупер', 11),
(110, 'Штаны1', 'Синий деним', 'супер пупер', 11),
(111, 'Штаны1', 'Синий деним', 'супер пупер', 11),
(112, 'Штаны1', 'Синий деним', 'супер пупер', 11),
(113, 'Штаны1', 'Синий деним', 'супер пупер', 11),
(114, 'Штаны1', 'Синий деним', 'супер пупер', 11),
(115, 'Штаны1', 'Синий деним', 'супер пупер', 11),
(116, 'Штаны1', 'Синий деним', 'супер пупер', 11),
(117, 'Штаны1', 'Синий деним', 'супер пупер', 11),
(118, 'Штаны1', 'Синий деним', 'супер пупер', 11),
(119, 'Штаны1', 'Синий деним', 'супер пупер', 11),
(120, 'Штаны1', 'Синий деним', 'супер пупер', 11),
(121, 'Штаны1', 'Синий деним', 'супер пупер', 11),
(122, 'Штаны1', 'Синий деним', 'супер пупер', 11),
(123, 'Штаны1', 'Синий деним', 'супер пупер', 11),
(124, 'Штаны1', 'Синий деним', 'супер пупер', 11),
(125, 'Штаны1', 'Синий деним', 'супер пупер', 11),
(126, 'Штаны1', 'Синий деним', 'супер пупер', 11),
(127, 'Штаны1', 'Синий деним', 'супер пупер', 11),
(128, 'Штаны1', 'Синий деним', 'супер пупер', 11),
(129, 'Штаны1', 'Синий деним', 'супер пупер', 11),
(130, 'Штаны1', 'Синий деним', 'супер пупер', 11),
(131, 'Штаны1', 'Синий деним', 'супер пупер', 11),
(132, 'Штаны1', 'Синий деним', 'супер пупер', 11),
(133, 'Штаны1', 'Синий деним', 'супер пупер', 11),
(134, 'Штаны1', 'Синий деним', 'супер пупер', 11),
(135, 'Штаны1', 'Синий деним', 'супер пупер', 11),
(136, 'Штаны1', 'Синий деним', 'супер пупер', 11),
(137, 'Штаны1', 'Синий деним', 'супер пупер', 11),
(138, 'Штаны1', 'Синий деним', 'супер пупер', 11),
(139, 'Штаны1', 'Синий деним', 'супер пупер', 11),
(140, 'Штаны1', 'Синий деним', 'супер пупер', 11),
(141, 'Штаны1', 'Синий деним', 'супер пупер', 11),
(142, 'Штаны1', 'Синий деним', 'супер пупер', 11),
(143, 'Штаны1', 'Синий деним', 'супер пупер', 11),
(144, 'Штаны1', 'Синий деним', 'супер пупер', 11),
(145, 'Штаны1', 'Синий деним', 'супер пупер', 11),
(146, 'Штаны1', 'Синий деним', 'супер пупер', 11),
(147, 'Штаны1', 'Синий деним', 'супер пупер', 11),
(148, 'Штаны1', 'Синий деним', 'супер пупер', 11),
(149, 'Штаны1', 'Синий деним', 'супер пупер', 11),
(150, 'Штаны1', 'Синий деним', 'супер пупер', 11),
(151, 'Штаны1', 'Синий деним', 'супер пупер', 11),
(152, 'Штаны1', 'Синий деним', 'супер пупер', 11),
(153, 'Штаны1', 'Синий деним', 'супер пупер', 11),
(154, 'Штаны1', 'Синий деним', 'супер пупер', 11),
(155, 'Штаны1', 'Синий деним', 'супер пупер', 11),
(156, 'Штаны1', 'Синий деним', 'супер пупер', 11),
(157, 'Штаны1', 'Синий деним', 'супер пупер', 11),
(158, 'Штаны1', 'Синий деним', 'супер пупер', 11),
(159, 'Штаны1', 'Синий деним', 'супер пупер', 11),
(160, 'Штаны1', 'Синий деним', 'супер пупер', 11),
(161, 'Штаны1', 'Синий деним', 'супер пупер', 11),
(162, 'Штаны1', 'Синий деним', 'супер пупер', 501);

-- --------------------------------------------------------

--
-- Структура таблицы `user`
--

CREATE TABLE IF NOT EXISTS `user` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `name` varchar(50) NOT NULL,
  `login` varchar(50) NOT NULL,
  `password` varchar(60) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB  DEFAULT CHARSET=utf8 AUTO_INCREMENT=2 ;

--
-- Дамп данных таблицы `user`
--

INSERT INTO `user` (`id`, `name`, `login`, `password`) VALUES
(1, 'Данила', 'danila', 'pass111');
